---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.LoopsDoNotSubdivideFace
source: html/6700b99f-c3cc-9bfd-53ad-3d5abf317764.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.LoopsDoNotSubdivideFace Property

Sketched loops must sub-divide the face into two or more completely enclosed regions.

## Syntax (C#)
```csharp
public static FailureDefinitionId LoopsDoNotSubdivideFace { get; }
```